robertlipe/riscv7/usr/sys/sys/n200/gd32v_lcd.c
// largely from
// https://raw.githubusercontent.com/sipeed/Longan_GD32VF_examples/master/gd32v_lcd/src/lcd/lcd.c
// Correction. That's where this code probably SHOULD have come from. This
// is closer to Longnan's own from
// https://github.com/sipeed/Longan_GD32VF_examples/blob/master/gd32v_lcd/src/lcd/lcd.c
// Or
// https://github.com/Xinyuan-LilyGO/LilyGO-T-DisplayGD32/blob/master/src/lcd/lcd.c
// Hardware seems to be approximately:
// https://www.displayfuture.com/Display/datasheet/controller/ST7735.pdf
// eh, more:
// https://www.displayfuture.com/Display/datasheet/controller/ST7789V.pdf

#include "gd32v_lcd.h"

#include "gd32vf103.h"
#include "oledfont.h"

#define ST7789_SWRESET 0x01
#define ST7789_SLPOUT 0x11
#define ST7789_NORON 0x13

#define ST7789_INVON 0x21
#define ST7789_CASET 0x2A
#define ST7789_RASET 0x2B
#define ST7789_RAMWR 0x2C
#define ST7789_RAMRD 0x2E
#define ST7789_PTLAR 0x2E // Partial Area?
#define ST7789_DISPOFF 0x28
#define ST7789_DISPON 0x29
#define ST7789_VSCRDEF 0x33 // Verticjal scrolling def?
#define ST7789_VSCRSADDR 0x37 // Vertial scrolling start of RAM?
#define ST7789_IDMOFF 0x38 // Idle Mode Off?
#define ST7789_IDMON 0x39 // Idle Mode on?

#define TFT_MAD_COLOR_ORDER TFT_MAD_RGB
#define TFT_MAD_MY 0x80
#define TFT_MAD_MX 0x40
#define TFT_MAD_MV 0x20
#define TFT_MAD_ML 0x10

#define ST7789_MADCTL 0x36  // Memory data access control
#define TFT_MAD_RGB 0x08
#define ST7789_COLMOD 0x3A     // Interface Pixel format
#define ST7789_WRDISBV 0x51     // Write display Brigthness?
#define ST7789_RDDISBV 0x52     // Read display brightness?
#define ST7789_RDCTRLD 0x53     // Write display CTRL brigthness?
#define ST7789_WRCTRLD 0x54     // Read display CTRL brightness?

#define ST7789_RGBCTRL 0xB1    // RGB Interface Cootrol
#define ST7789_PORCTRL 0xB2    // Porch control
#define ST7789_FRCTRL1 0xB3    // Porch control
#define ST7789_GCTRL 0xB7      // Gate control
#define ST7789_VCOMS 0xBB      // VCOMS setting
#define ST7789_LCMCTRL 0xC0    // LCM control
#define ST7789_IDSET 0xC1      // ID Code Setting
#define ST7789_VDVVRHEN 0xC2   // VDV and VRH command enable
#define ST7789_VRHS 0xC3       // VRH set
#define ST7789_VDVSET 0xC4     // VDV setting
#define ST7789_VCMOFSET 0xC5     // VCOMS offset setting
#define ST7789_FRCTR2 0xC6     // FR Control 2
#define ST7789_PWCTRL1 0xD0    // Power control 1
#define ST7789_RDID1 0xDA      // read LCD panel ID1 ?
#define ST7789_RDID2 0xDB      // read LCD panel ID2 ?
#define ST7789_RDID3 0xDC      // read LCD panel ID3 ?
#define ST7789_PVGAMCTRL 0xE0  // Positive voltage gamma control
#define ST7789_NVGAMCTRL 0xE1  // Negative voltage gamma control

#define BMP 0
#if BMP
#include "n200/bmp.h"
#endif

u16 BACK_COLOR;        // Background color

int cursor_x; // Current text cursor.
int cursor_y;

// Arbitrary max tries before declaring LCD dead.
// In practice, I've not seen it be > 1.
#define MAX_TRIES 10
int lcd_disabled = 0;  // Device has failed. Quit trying.

u16 colstart = 52;
u16 rowstart = 40;
// The hardware is 80x160px. Why these crazy numbers?
u16 init_height_ = 240;
u16 init_width_ = 135;
u16 width_ = 135;
u16 height_ = 240;
u8 rotation_ = 0;

static void LCD_SetVerticalScrollArea(int tfa, int bfa);
static void LCD_VerticalScroll(unsigned lines);

/******************************************************************************
       Function description: LCD serial data write function
       Entry data: serial data to be written to dat
       Return value: None
******************************************************************************/
static void LCD_WriteBus_(u8 dat) {
#if SPI0_CFG == 1
  OLED_CS_Clr();
  int timeout_ct = 0;
  if (lcd_disabled) return;

  while (RESET == spi_i2s_flag_get(SPI0, SPI_FLAG_TBE)) {
    if (timeout_ct++ >= MAX_TRIES) {
      led_alarm();
      lcd_disabled = 1;
      printf("SPIO failed. on transmit. Disabling.");
      return;
    }
  }
  spi_i2s_data_transmit(SPI0, dat);
  while (RESET == spi_i2s_flag_get(SPI0, SPI_FLAG_RBNE)) {
    if (timeout_ct++ >= MAX_TRIES) {
      led_alarm();
      lcd_disabled = 1;
      printf("SPIO failed. on receive. Disabling.");
      return;
    }
  }
  spi_i2s_data_receive(SPI0);

  OLED_CS_Set();
#elif SPI0_CFG == 2
  spi_dma_enable(SPI0, SPI_DMA_TRANSMIT);
#else
  u8 i;
  OLED_CS_Clr();
  for (i = 0; i < 8; i++) {
    OLED_SCLK_Clr();
    if (dat & 0x80)
      OLED_SDIN_Set();
    else
      OLED_SDIN_Clr();
    OLED_SCLK_Set();
    dat <<= 1;
  }
  OLED_CS_Set();
#endif
}

/******************************************************************************
       Function description: LCD write data
       Entry data: data written by dat
       Return value: None
******************************************************************************/
void LCD_WriteData8_(u8 dat) {
  OLED_DC_Set();  // Write data
  LCD_WriteBus_(dat);
}

/******************************************************************************
           Function description: LCD write data
       Entry data: data written by dat
       Return value: None
******************************************************************************/
void LCD_WriteData16_(u16 dat) {
  OLED_DC_Set();  // Write data
  LCD_WriteBus_(dat >> 8);
  LCD_WriteBus_(dat);
}

/******************************************************************************
           Function description: LCD write command
       Entry data: command written by dat
       Return value: None
******************************************************************************/
void LCD_WriteReg_(u8 dat) {
  OLED_DC_Clr();  // Write command
  LCD_WriteBus_(dat);
}

/******************************************************************************
           Function description: Set start and end addresses
       Entry data: x1, x2 set the start and end addresses of the column
                   y1, y2 set the start and end addresses of the line
       Return value: None
******************************************************************************/
#if 0
void LCD_SetAddress_(u16 x1, u16 y1, u16 x2, u16 y2) {
  if (USE_HORIZONTAL == 0) {
    LCD_WriteReg_(ST7789_CASET);  // Column address settings
    LCD_WriteData16_(x1 + 26);
    LCD_WriteData16_(x2 + 26);
    LCD_WriteReg_(ST7789_RASET);  // Row address setting
    LCD_WriteData16_(y1 + 1);
    LCD_WriteData16_(y2 + 1);
    LCD_WriteReg_(ST7789_RAMWR);  // Memory write
  } else if (USE_HORIZONTAL == 1) {
    LCD_WriteReg_(ST7789_CASET);  // Column address settings
    LCD_WriteData16_(x1 + 26);
    LCD_WriteData16_(x2 + 26);
    LCD_WriteReg_(ST7789_RASET);  // Row address setting
    LCD_WriteData16_(y1 + 1);
    LCD_WriteData16_(y2 + 1);
    LCD_WriteReg_(ST7789_RAMWR);  // Memory write
  } else if (USE_HORIZONTAL == 2) {
    LCD_WriteReg_(ST7789_CASET);  // Column address settings
    LCD_WriteData16_(x1 + 1);
    LCD_WriteData16_(x2 + 1);
    LCD_WriteReg_(ST7789_RASET);  // Row address setting
    LCD_WriteData16_(y1 + 26);
    LCD_WriteData16_(y2 + 26);
    LCD_WriteReg_(ST7789_RAMWR);  // Memory write
  } else {
    LCD_WriteReg_(ST7789_CASET);  // Column address settings
    LCD_WriteData16_(x1 + 1);
    LCD_WriteData16_(x2 + 1);
    LCD_WriteReg_(ST7789_RASET);  // Row address setting
    LCD_WriteData16_(y1 + 26);
    LCD_WriteData16_(y2 + 26);
    LCD_WriteReg_(ST7789_RAMWR);  // Memory write
  }
}
#else
void LCD_SetAddress_(u16 x1, u16 y1, u16 x2, u16 y2) {
    uint16_t x_start = x1 + colstart, x_end = x2 + colstart;
    uint16_t y_start = y1 + rowstart, y_end = y2 + rowstart;

    LCD_WriteReg_(ST7789_CASET);  // Column address settings
#if 1
    LCD_WriteData16_(x1 + 1);
    LCD_WriteData16_(x2 + 1);
#else
// THESE SHOULD NOT BE THE SAME
    LCD_WriteData16_(x1 + colstart); // XSTART
    LCD_WriteData16_(x2 + colstart); // XEND
#endif
    LCD_WriteReg_(ST7789_RASET);  // Row address setting
#if 1
    LCD_WriteData16_(y1 + 26);
    LCD_WriteData16_(y2 + 26);
#else
// THESE SHOULD NOT BE THE SAME
    LCD_WriteData16_(y1 + rowstart); // YSTART
    LCD_WriteData16_(y2 + rowstart); // YEND
#endif
    LCD_WriteReg_(ST7789_RAMWR);  // Memory write
}
#endif

#if SPI0_CFG == 2
/*!
    \brief      configure the DMA peripheral
    \param[in]  none
    \param[out] none
    \retval     none
*/
void dma_config(void) {
  dma_parameter_struct dma_init_struct;

  /* SPI0 transmit dma config:DMA0,DMA_CH2 */
  dma_deinit(DMA0, DMA_CH2);
  dma_struct_para_init(&dma_init_struct);

  dma_init_struct.periph_addr = (uint32_t)&SPI_DATA(SPI0);
  dma_init_struct.memory_addr = (uint32_t)image;
  dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
  dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
  dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
  dma_init_struct.priority = DMA_PRIORITY_LOW;
  dma_init_struct.number = FRAME_SIZE;
  dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
  dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
  dma_init(DMA0, DMA_CH2, &dma_init_struct);
  /* configure DMA mode */
  dma_circulation_disable(DMA0, DMA_CH2);
  dma_memory_to_memory_disable(DMA0, DMA_CH2);
}
#endif

#if SPI0_CFG == 1
/*!
    \brief      configure the SPI peripheral
    \param[in]  none
    \param[out] none
    \retval     none
*/
void spi_config(void) {
  spi_parameter_struct spi_init_struct;
  /* deinitilize SPI and the parameters */
  OLED_CS_Set();
  spi_struct_para_init(&spi_init_struct);

  /* SPI0 parameter config */
  spi_init_struct.trans_mode = SPI_TRANSMODE_FULLDUPLEX;
  spi_init_struct.device_mode = SPI_MASTER;
  spi_init_struct.frame_size = SPI_FRAMESIZE_8BIT;
  spi_init_struct.clock_polarity_phase = SPI_CK_PL_HIGH_PH_2EDGE;
  spi_init_struct.nss = SPI_NSS_SOFT;
  spi_init_struct.prescale = SPI_PSC_8;
  spi_init_struct.endian = SPI_ENDIAN_MSB;
  spi_init(SPI0, &spi_init_struct);

  spi_crc_polynomial_set(SPI0, 7);
  spi_enable(SPI0);
}
#endif

void LCD_SetRotation_(uint8_t m) {
  rotation_ = m % 4;
  LCD_WriteReg_(ST7789_MADCTL);
  switch (rotation_) {
    case 0: // Portrait
      colstart = 52;
      rowstart = 40;
      width_ = init_width_;
      height_ = init_height_;
      LCD_WriteData8_(TFT_MAD_COLOR_ORDER);
      break;

    case 1: // Landscape
      colstart = 40;
      rowstart = 53;
      width_ = init_height_;
      height_ = init_width_;
      LCD_WriteData8_(TFT_MAD_MX | TFT_MAD_MV | TFT_MAD_COLOR_ORDER);
      break;
    case 2: // Upside down portrait
      colstart = 52;
      rowstart = 40;
      width_ = init_width_;
      height_ = init_height_;
      LCD_WriteData8_(TFT_MAD_MX | TFT_MAD_MY | TFT_MAD_COLOR_ORDER);
      break;
    case 3: // Upside down landscape
      colstart = 40;
      rowstart = 52;
      width_ = init_height_;
      height_ = init_width_;
      LCD_WriteData8_(TFT_MAD_MV | TFT_MAD_MY | TFT_MAD_COLOR_ORDER);
      break;
  }
  LCD_SetVerticalScrollArea(rowstart, rowstart);
}

