robertlipe/riscv7/usr/sys/sys/n200/gd32v_lcd.c
#define spi_wait_idle()                     \
  do {                                      \
    while (SPI_STAT(SPI0) & SPI_STAT_TRANS) \
      ;                                     \
  } while (0)

#define lcd_mode_data()              \
  do {                               \
    gpio_bit_set(GPIOB, GPIO_PIN_0); \
  } while (0)

static LCD_InitPanel_() {
  static const uint8_t init_sequence[] = {
      ST7789_INVON, 0xff,  // display inversion
      ST7789_RGBCTRL, 0x05, 0x3a, 0x3a, 0xff,  // frame freq, color: RTNA + FPA + BNA
      ST7789_PORCTRL, 0x05, 0x3a, 0x3a, 0xff,  // frame freq, idle: RTNB + FPB + BPB
      ST7789_FRCTRL1, 0x05, 0x3a, 0x3a, 0x05, 0x3a, 0x3a, 0xff,  // ff: partial
      0xb4, 0x03, 0xff,
      ST7789_LCMCTRL, 0x62, 0x02, 0x04, 0xff,
      ST7789_IDSET, 0xc0, 0xff,
      ST7789_VDVVRHEN, 0x0d, 0x00, 0xff,
      ST7789_VRHS, 0x8d, 0x6a, 0xff,
      ST7789_VDVSET, 0x8d, 0xee, 0xff,
      ST7789_VCMOFSET, 0x0e, 0xff,  // VCCOM
      ST7789_PVGAMCTRL, 0x10, 0x0e, 0x02, 0x03, 0x0e, 0x07, 0x02,
          0x07, 0x0a, 0x12, 0x27, 0x37, 0x00, 0x0d, 0x0e, 0x10, 0xff,
      ST7789_NVGAMCTRL, 0x10, 0x0e, 0x03, 0x03, 0x0f, 0x06, 0x02,
          0x08, 0x0a, 0x13, 0x26, 0x36, 0x00, 0x0d, 0x0e, 0x10, 0xff,
      ST7789_COLMOD, 0x55, 0xff,  // format of RGB picture data: 16bpp
      ST7789_MADCTL, 0x78, 0xff,  // Horiz data
      ST7789_DISPON, 0xff,  // Display on.
      ST7789_SLPOUT, 0xff,  // Turn off sleep mode
      0xff };

  LCD_WriteReg_(ST7789_SWRESET);
  delay_1ms(150);

  // Initialize the display.
  for (const uint8_t *p = init_sequence; *p != 0xff; p++) {
    LCD_WriteReg_(*p++);
    if (*p == 0xff) continue;
    spi_wait_idle();
    lcd_mode_data();
    while (*p != 0xff) LCD_WriteData8_(*p++);
    delay_1ms(10); // Not strictly required for every command above.
  }
}

/******************************************************************************
           Function description: LCD initialization function
       Entry data: None
       Return value: None
******************************************************************************/
void LCD_Init(void) {
  lcd_disabled = 0;

  rcu_periph_clock_enable(RCU_GPIOA);
  rcu_periph_clock_enable(RCU_GPIOB);

  // Power up GPIOA and GPIOB. A is probably enabled from LED.
  RCU->APB2EN |= RCU_APB2EN_PAEN | RCU_APB2EN_PBEN;
  // Power up SPI0. This bit seems to float randomly on cold power-up.
  RCU->APB2EN |= RCU_APB2EN_AFEN | RCU_APB2EN_SPI0EN;

  // Clear backlight early just so we can tell we've reset in case
  // the following doesn't work. In practice this doesn't help much.
  OLED_BLK_Clr();

#if SPI0_CFG == 1
  rcu_periph_clock_enable(RCU_AF);
  rcu_periph_clock_enable(RCU_SPI0);
  /* SPI0 GPIO config: NSS/PA4, SCK/PA5, MOSI/PA7 */
  gpio_init(GPIOA, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ,
            GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7);
  gpio_init(GPIOB, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_2);

  spi_config();

#elif SPI0_CFG == 2
  rcu_periph_clock_enable(RCU_DMA0);
  rcu_periph_clock_enable(RCU_SPI0);

  /* SPI0 GPIO config: NSS/PA4, SCK/PA5, MOSI/PA7 */
  gpio_init(GPIOA, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ,
            GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_7);
  /* SPI0 GPIO config: MISO/PA6 */
  gpio_init(GPIOA, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, GPIO_PIN_6);

  dma_config();

  dma_channel_enable(DMA0, DMA_CH2);
#elif SPI0_CFG == 3
  gpio_init(GPIOA, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ,
            GPIO_PIN_5 | GPIO_PIN_7);
  gpio_init(GPIOB, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_2);

  gpio_bit_reset(GPIOA, GPIO_PIN_5 | GPIO_PIN_7);
  gpio_bit_reset(GPIOB, GPIO_PIN_2);
#endif

  gpio_init(GPIOB, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ,
            GPIO_PIN_0 | GPIO_PIN_1);
  gpio_bit_reset(GPIOB, GPIO_PIN_0 | GPIO_PIN_1);

  OLED_RST_Clr();
  delay_1ms(200);
  OLED_RST_Set();
  delay_1ms(20);
  OLED_BLK_Set();

  LCD_SetRotation_(1);
  LCD_InitPanel_();
  cursor_x = 0;
  cursor_y = 0;
}

/******************************************************************************
           Function description: LCD clear screen function
       Entry data: None
       Return value: None
******************************************************************************/
void LCD_Clear(u16 Color) {
  u16 i, j;
  LCD_SetAddress_(0, 0, width_ - 1, height_ - 1);
  for (i = 0; i < width_; i++) {
    for (j = 0; j < height_; j++) {
      LCD_WriteData16_(Color);
    }
  }
}

void LCD_SetDisplayPower(int state) {
  if (state) {
         OLED_BLK_Set();
         LCD_WriteReg_(ST7789_DISPON);
  } else {
         OLED_BLK_Clr();
         LCD_WriteReg_(ST7789_DISPOFF);
  }
}

// Called from debugger to generate text for scroll events. $(gdb) p words(15)
void words(int x) {
  static wct;
  while (x>0) {
    printf("word %d.", wct++);
    SEGGER_RTT_WriteString(0, "Hello World from SEGGER!\r\n");
    x--;
  }
}

#if CHINESE
/******************************************************************************
           Function description: LCD display Chinese characters
       Entry data: x, y starting coordinates
                   index Chinese character number
                   size font size
       Return value: None
******************************************************************************/
void LCD_ShowChinese(u16 x, u16 y, u8 index, u8 size, u16 color) {
  u8 i, j;
  u8 *temp, size1;
  if (size == 16) {
    temp = Hzk16;
  }  //选择字号
  if (size == 32) {
    temp = Hzk32;
  }
  LCD_SetAddress_(x, y, x + size - 1, y + size - 1);  //设置一个汉字的区域
  size1 = size * size / 8;  //一个汉字所占的字节
  temp += index * size1;    //写入的起始位置
  for (j = 0; j < size1; j++) {
    for (i = 0; i < 8; i++) {
      if ((*temp & (1 << i)) != 0)  //从数据的低位开始读
      {
        LCD_WriteData16_(color);  //点亮
      } else {
        LCD_WriteData16_(BACK_COLOR);  //不点亮
      }
    }
    temp++;
  }
}
#endif  // CHINESE

/******************************************************************************
           Function description: LCD draws point
       Entry data: x, y starting coordinates
       Return value: None
******************************************************************************/
void LCD_DrawPoint(u16 x, u16 y, u16 color) {
  LCD_SetAddress_(x, y, x, y);  //设置光标位置
  LCD_WriteData16_(color);
}

