robertlipe/riscv7/usr/sys/sys/n200/gd32v_lcd.c
/******************************************************************************
           Function description: LCD draws a large dot
       Entry data: x, y starting coordinates
       Return value: None
******************************************************************************/
void LCD_DrawPoint_big(u16 x, u16 y, u16 color) {
  LCD_Fill(x - 1, y - 1, x + 1, y + 1, color);
}

/******************************************************************************
           Function description: fill color in the specified area
       Entry data: xsta, ysta starting coordinates
                   xend, yend termination coordinates
       Return value: None
******************************************************************************/
void LCD_Fill(u16 xsta, u16 ysta, u16 xend, u16 yend, u16 color) {
  u16 i, j;
  LCD_SetAddress_(xsta, ysta, xend, yend);  //设置光标位置
  for (i = ysta; i <= yend; i++) {
    for (j = xsta; j <= xend; j++) LCD_WriteData16_(color);  //设置光标位置
  }
}

/******************************************************************************
           Function description: draw a line
       Entry data: x1, y1 starting coordinates
                   x2, y2 terminating coordinates
       Return value: None
******************************************************************************/
void LCD_DrawLine(u16 x1, u16 y1, u16 x2, u16 y2, u16 color) {
  u16 t;
  int xerr = 0, yerr = 0, delta_x, delta_y, distance;
  int incx, incy, uRow, uCol;
  delta_x = x2 - x1;  //计算坐标增量
  delta_y = y2 - y1;
  uRow = x1;  //画线起点坐标
  uCol = y1;
  if (delta_x > 0)
    incx = 1;  //设置单步方向
  else if (delta_x == 0)
    incx = 0;  //垂直线
  else {
    incx = -1;
    delta_x = -delta_x;
  }
  if (delta_y > 0)
    incy = 1;
  else if (delta_y == 0)
    incy = 0;  //水平线
  else {
    incy = -1;
    delta_y = -delta_x;
  }
  if (delta_x > delta_y)
    distance = delta_x;  //选取基本增量坐标轴
  else
    distance = delta_y;
  for (t = 0; t < distance + 1; t++) {
    LCD_DrawPoint(uRow, uCol, color);  //画点
    xerr += delta_x;
    yerr += delta_y;
    if (xerr > distance) {
      xerr -= distance;
      uRow += incx;
    }
    if (yerr > distance) {
      yerr -= distance;
      uCol += incy;
    }
  }
}

/******************************************************************************
           Function description: draw a rectangle
       Entry data: x1, y1 starting coordinates
                   x2, y2 terminating coordinates
       Return value: None
******************************************************************************/
void LCD_DrawRectangle(u16 x1, u16 y1, u16 x2, u16 y2, u16 color) {
  LCD_DrawLine(x1, y1, x2, y1, color);
  LCD_DrawLine(x1, y1, x1, y2, color);
  LCD_DrawLine(x1, y2, x2, y2, color);
  LCD_DrawLine(x2, y1, x2, y2, color);
}

/******************************************************************************
           Function description: draw circle
       Entry data: x0, y0 center coordinates
                   r radius
       Return value: None
******************************************************************************/
void LCD_DrawCircle(u16 x0, u16 y0, u8 r, u16 color) {
  int a, b;
  // int di;
  a = 0;
  b = r;
  while (a <= b) {
    LCD_DrawPoint(x0 - b, y0 - a, color);  // 3
    LCD_DrawPoint(x0 + b, y0 - a, color);  // 0
    LCD_DrawPoint(x0 - a, y0 + b, color);  // 1
    LCD_DrawPoint(x0 - a, y0 - b, color);  // 2
    LCD_DrawPoint(x0 + b, y0 + a, color);  // 4
    LCD_DrawPoint(x0 + a, y0 - b, color);  // 5
    LCD_DrawPoint(x0 + a, y0 + b, color);  // 6
    LCD_DrawPoint(x0 - b, y0 + a, color);  // 7
    a++;
    if ((a * a + b * b) >
        (r * r))  // Determine whether the points to be drawn are too far away
    {
      b--;
    }
  }
}

/******************************************************************************
           Function description: display characters
       Entry data: x, y starting point coordinates
                   num characters to display
                   mode 1 superimposed mode 0 non-superimposed mode
       Return value: None
******************************************************************************/
void LCD_ShowChar(u16 x, u16 y, u8 num, u8 mode, u16 color) {
  u8 temp;
  u8 pos, t;
  u16 x0 = x;
  if (x > width_ - 16 || y > height_ - 16) return;  // Settings window
  num = num - ' ';                                  // Get offset value
  LCD_SetAddress_(x, y, x + 8 - 1, y + 16 - 1);     // Set cursor position
  if (!mode)                                        // Non-overlapping
  {
    for (pos = 0; pos < 16; pos++) {
      temp = asc2_1608[(u16)num * 16 + pos];  // Call 1608 font
      for (t = 0; t < 8; t++) {
        if (temp & 0x01)
          LCD_WriteData16_(color);
        else
          LCD_WriteData16_(BACK_COLOR);
        temp >>= 1;
        x++;
      }
      x = x0;
      y++;
    }
  } else  // overlapping mode
  {
    for (pos = 0; pos < 16; pos++) {
      temp = asc2_1608[(u16)num * 16 + pos];  // Call 1608 font
      for (t = 0; t < 8; t++) {
        if (temp & 0x01) LCD_DrawPoint(x + t, y + pos, color);  // Draw a dot
        temp >>= 1;
      }
    }
  }
}

#if NOTUSED
/******************************************************************************
           Function description: display string
       Entry data: x, y starting point coordinates
                   *p string start address
       Return value: None
******************************************************************************/
void LCD_ShowString(u16 x, u16 y, const u8 *p, u16 color) {
  while (*p != '\0') {
    if (x > width_ - 16) {
      x = 0;
      y += 16;
    }
    if (y > height_ - 16) {
      x = 0;
      y = LCD_H - 16;
      LCD_VerticalScroll(16);
      LCD_Clear(RED);
    }
    LCD_ShowChar(x, y, *p, 0, color);
    x += 8;
    p++;
  }
}
#endif // NOTUSED

unsigned long LCD_time_to_blank = 0;
int LCD_blanked = 0;

void LCD_Putc(char cdata, u16 color) {
  int x = cursor_x;
  int y = cursor_y;
  int c = cdata & 0xff; // Smuggle attributes in high bits of chars.

  if (LCD_blanked) {
    LCD_SetDisplayPower(1);
  }
// These should come from h/system and parm. The SHOULD be run
// from a "real" driver that does a skeep and schedules a wekaup
// that keeps gettting canceled and rescheduled.
extern int lbolt;
#define HZ 60
  LCD_time_to_blank = lbolt + 5*HZ;

  if (c == '\n') {
    x = 0;
    y += 16;
    LCD_ClearToEol();
  } else if (c == '\r') {
    y++;
  } else {
    LCD_ShowChar(x, y, c, 0, color);
    x += 8;
  }

