robertlipe/riscv7/usr/sys/sys/n200/gd32v_lcd.c
  if (x > LCD_W - 8) {
    x = 0;
    y += 16;
  }
  if (y > LCD_H - 16) {
    x = 0;
    // y = LCD_H - 16;
    y = 0;
    LCD_VerticalScroll(16);
    // LCD_Clear(RED);
  }
  cursor_x = x;
  cursor_y = y;
}

void LCD_Erase() {
  if (cursor_x > 0) {
    cursor_x--;
    LCD_ShowChar(cursor_x, cursor_y, ' ', 0, GREEN);
  }
}

void LCD_ClearToEol() {
  while (cursor_x < (width_ / 8)) {
    LCD_Putc('X', RED);
//    cursor_x += 8;
  }
  cursor_x = 0;
}

void LCD_SetVerticalScrollArea(int tfa, int bfa) {
  uint16_t vsa = 320-tfa-bfa; // ST7789 320x240 VRAM

  LCD_WriteReg_(ST7789_VSCRDEF);  // Define scroll area.
  LCD_WriteData16_(tfa); // TOP FIXED AREA. from top
  LCD_WriteData16_(vsa); // Vert. Scrolling area
  LCD_WriteData16_(bfa); // BOT FIXED AREA. from botom
}

void LCD_VerticalScroll(unsigned lines) {
return;
  LCD_WriteReg_(ST7789_VSCRSADDR);  // Define scroll area.
  LCD_WriteData16_(lines); // Do the scroll.
  return;
}

// END LOCAL

#define SHOW_NUM_NEEDED 0
#if SHOW_NUM_NEEDED
/******************************************************************************
           Function description: display numbers
       Entry data: base m, n exponent
       Return value: None
******************************************************************************/
u32 mypow(u8 m, u8 n) {
  u32 result = 1;
  while (n--) result *= m;
  return result;
}

/******************************************************************************
           Function description: display numbers
       Entry data: x, y starting point coordinates
                   num number to display
                   len number of digits to display
       Return value: None
******************************************************************************/
void LCD_ShowNum(u16 x, u16 y, u32 num, u8 len, u16 color) {
  u8 t, temp;
  u8 enshow = 0;
  for (t = 0; t < len; t++) {
    temp = (num / mypow(10, len - t - 1)) % 10;
    if (enshow == 0 && t < (len - 1)) {
      if (temp == 0) {
        LCD_ShowChar(x + 8 * t, y, ' ', 0, color);
        continue;
      } else
        enshow = 1;
    }
    LCD_ShowChar(x + 8 * t, y, temp + 48, 0, color);
  }
}

/******************************************************************************
           Function description: display decimal
       Entry data: x, y starting point coordinates
                   num decimal to display
                   len number of digits to display
       Return value: None
******************************************************************************/
void LCD_ShowNum1(u16 x, u16 y, float num, u8 len, u16 color) {
  u8 t, temp;
  // u8 enshow=0;
  u16 num1;
  num1 = num * 100;
  for (t = 0; t < len; t++) {
    temp = (num1 / mypow(10, len - t - 1)) % 10;
    if (t == (len - 2)) {
      LCD_ShowChar(x + 8 * (len - 2), y, '.', 0, color);
      t++;
      len += 1;
    }
    LCD_ShowChar(x + 8 * t, y, temp + 48, 0, color);
  }
}
}
#endif  // SHOW_NUM_NEEDED

#if BMP
/******************************************************************************
           Function description: display 160x40 16bit (RGB565) picture
       Entry data: x, y starting point coordinates
       Return value: None
******************************************************************************/
void LCD_ShowPicture(u16 x1, u16 y1, u16 x2, u16 y2) {
  int i;
  LCD_SetAddress_(x1, y1, x2, y2);
  for (i = 0; i < 12800; i++) {
    LCD_WriteData8_(image[i]);
  }
}

void LCD_ShowLogo(void) {
  int i;
  LCD_SetAddress_(0, 0, 159, 75);
  for (i = 0; i < 25600; i++) {
    LCD_WriteData8_(logo_bmp[i]);
  }
}

#endif  //  BMP
